#pragma once

#include "../pch.h"


class KeyListener
{
public:
	int32_t N0000004F; //0x0000
	int32_t N00000158; //0x0004
	int32_t N00000050; //0x0008
	int32_t N0000015B; //0x000C
	int32_t N00000051; //0x0010
	int32_t N0000015D; //0x0014
	int32_t N00000052; //0x0018
	int32_t N0000015F; //0x001C
	int32_t BACK; //0x0020
	int32_t TAB; //0x0024
	int32_t N00000054; //0x0028
	int32_t N00000163; //0x002C
	int32_t N00000055; //0x0030
	int32_t RETURN; //0x0034
	int32_t N00000056; //0x0038
	int32_t N00000167; //0x003C
	int32_t SHIFT; //0x0040
	int32_t CTRL; //0x0044
	int32_t ALT; //0x0048
	int32_t PAUSE; //0x004C
	int32_t CAPS; //0x0050
	int32_t N0000016D; //0x0054
	int32_t N0000005A; //0x0058
	int32_t N0000016F; //0x005C
	int32_t N0000005B; //0x0060
	int32_t N00000171; //0x0064
	int32_t N0000005C; //0x0068
	int32_t ESC; //0x006C
	int32_t N0000005D; //0x0070
	int32_t N00000175; //0x0074
	int32_t N0000005E; //0x0078
	int32_t N00000177; //0x007C
	int32_t SPACE; //0x0080
	int32_t PAGE_UP; //0x0084
	int32_t PAGE_DOWN; //0x0088
	int32_t END; //0x008C
	int32_t POS1; //0x0090
	int32_t ARROW_LEFT; //0x0094
	int32_t ARROW_UP; //0x0098
	int32_t ARROR_RIGHT; //0x009C
	int32_t ARROW_DOWN; //0x00A0
	int32_t N00000181; //0x00A4
	int32_t N00000064; //0x00A8
	int32_t N00000183; //0x00AC
	int32_t N00000065; //0x00B0
	int32_t INSERT; //0x00B4
	int32_t DEL; //0x00B8
	int32_t N00000187; //0x00BC
	int32_t VK_0; //0x00C0
	int32_t VK_1; //0x00C4
	int32_t VK_2; //0x00C8
	int32_t VK_3; //0x00CC
	int32_t VK_4; //0x00D0
	int32_t VK_5; //0x00D4
	int32_t VK_6; //0x00D8
	int32_t VK_7; //0x00DC
	int32_t VK_8; //0x00E0
	int32_t VK_9; //0x00E4
	int32_t N0000006C; //0x00E8
	int32_t N00000193; //0x00EC
	int32_t N0000006D; //0x00F0
	int32_t N00000195; //0x00F4
	int32_t N0000006E; //0x00F8
	int32_t N00000197; //0x00FC
	int32_t N0000006F; //0x0100
	int32_t VK_A; //0x0104
	int32_t VK_B; //0x0108
	int32_t VK_C; //0x010C
	int32_t VK_D; //0x0110
	int32_t VK_E; //0x0114
	int32_t VK_F; //0x0118
	int32_t VK_G; //0x011C
	int32_t VK_H; //0x0120
	int32_t VK_I; //0x0124
	int32_t VK_J; //0x0128
	int32_t VK_K; //0x012C
	int32_t VK_L; //0x0130
	int32_t VK_M; //0x0134
	int32_t VK_N; //0x0138
	int32_t VK_O; //0x013C
	int32_t VK_P; //0x0140
	int32_t VK_Q; //0x0144
	int32_t VK_R; //0x0148
	int32_t VK_S; //0x014C
	int32_t VK_T; //0x0150
	int32_t VK_U; //0x0154
	int32_t VK_V; //0x0158
	int32_t VK_W; //0x015C
	int32_t VK_X; //0x0160
	int32_t VK_Y; //0x0164
	int32_t VK_Z; //0x0168
	int32_t N000001D1; //0x016C
	int32_t N000003AF; //0x0170
	int32_t N0000007B; //0x0174
	int32_t N000001D3; //0x0178
	int32_t N0000007C; //0x017C
	int32_t NUMPAD_0; //0x0180
	int32_t NUMPAD_1; //0x0184
	int32_t NUMPAD_2; //0x0188
	int32_t NUMPAD_3; //0x018C
	int32_t NUMPAD_4; //0x0190
	int32_t NUMPAD_5; //0x0194
	int32_t NUMPAD_6; //0x0198
	int32_t NUMPAD_7; //0x019C
	int32_t NUMPAD_8; //0x01A0
	int32_t NUMPAD_9; //0x01A4
	int32_t N000001DF; //0x01A8
	int32_t NUMPAD_PLUS; //0x01AC
	int32_t N000001E1; //0x01B0
	int32_t NUMPAD_MINUS; //0x01B4
	int32_t NUMPAD_COMMA; //0x01B8
	int32_t NUMPAD_DIVIDE; //0x01BC
	int32_t N000001E5; //0x01C0
	int32_t N00000085; //0x01C4
	int32_t N000001E7; //0x01C8
	int32_t N00000086; //0x01CC
	int32_t N000001E9; //0x01D0
	int32_t F1; //0x01D4
	int32_t F2; //0x01D8
	int32_t F3; //0x01DC
	int32_t F4; //0x01E0
	int32_t F5; //0x01E4
	int32_t F6; //0x01E8
	int32_t F7; //0x01EC
	int32_t F8; //0x01F0
	int32_t F9; //0x01F4
	int32_t F10; //0x01F8
	int32_t F11; //0x01FC
	int32_t F12; //0x0200
	int32_t N0000008D; //0x0204
	int32_t N000001F7; //0x0208
	int32_t N0000008E; //0x020C
	int32_t N000001F9; //0x0210
	int32_t N0000008F; //0x0214
	int32_t N000001FB; //0x0218
	int32_t N00000090; //0x021C
	int32_t N000001FD; //0x0220
	int32_t N00000091; //0x0224
	int32_t N000001FF; //0x0228
	int32_t N00000092; //0x022C
	int32_t N00000201; //0x0230
	int32_t N00000093; //0x0234
	int32_t N00000203; //0x0238
	int32_t N00000094; //0x023C
	int32_t N00000205; //0x0240
	int32_t SCROLL_LOCK; //0x0244
	int32_t N00000207; //0x0248
	int32_t N00000096; //0x024C
	int32_t N00000209; //0x0250
	int32_t N00000097; //0x0254
	int32_t N0000020B; //0x0258
	int32_t N00000098; //0x025C
	int32_t N0000020D; //0x0260
	int32_t N00000099; //0x0264
	int32_t N0000020F; //0x0268
	int32_t N0000009A; //0x026C
	int32_t N00000211; //0x0270
	int32_t N0000009B; //0x0274
	int32_t N00000213; //0x0278
	int32_t N0000009C; //0x027C
	int32_t N000003DB; //0x0280
	int32_t N0000009D; //0x0284
	int32_t N000003DD; //0x0288
	int32_t N0000009E; //0x028C
	int32_t N000003DF; //0x0290
	int32_t N0000009F; //0x0294
	int32_t N000003E1; //0x0298
	int32_t N000000A0; //0x029C
	int32_t N000003E3; //0x02A0
	int32_t N000000A1; //0x02A4
	int32_t N000003E5; //0x02A8
	int32_t N000000A2; //0x02AC
	int32_t N000003E7; //0x02B0
	int32_t N000000A3; //0x02B4
	int32_t N000003E9; //0x02B8
	int32_t N000000A4; //0x02BC
	int32_t N000003EB; //0x02C0
	int32_t N000000A5; //0x02C4
	int32_t N000003ED; //0x02C8
	int32_t N000000A6; //0x02CC
	int32_t N000003EF; //0x02D0
	int32_t N000000A7; //0x02D4
	int32_t N000003F1; //0x02D8
	int32_t N000000A8; //0x02DC
	int32_t N000003F3; //0x02E0
	int32_t N000000A9; //0x02E4
	int32_t N000003F5; //0x02E8
	int32_t PLUS; //0x02EC
	int32_t COMMA; //0x02F0
	int32_t HYPEN; //0x02F4
	int32_t PERIOD; //0x02F8
	int32_t OTHORPE; //0x02FC
	int32_t N000003FB; //0x0300
	int32_t N000000AD; //0x0304
	int32_t N000003FD; //0x0308
	int32_t N000000AE; //0x030C
	int32_t N000003FF; //0x0310
	int32_t N000000AF; //0x0314
	int32_t N00000401; //0x0318
	int32_t N000000B0; //0x031C
	int32_t N00000403; //0x0320
	int32_t N000000B1; //0x0324
	int32_t N00000405; //0x0328
	int32_t N000000B2; //0x032C
	int32_t N00000407; //0x0330
	int32_t N000000B3; //0x0334
	int32_t N00000409; //0x0338
	int32_t N000000B4; //0x033C
	int32_t N0000040B; //0x0340
	int32_t N000000B5; //0x0344
	int32_t N0000040D; //0x0348
	int32_t N000000B6; //0x034C
	int32_t N0000040F; //0x0350
	int32_t N000000B7; //0x0354
	int32_t N00000411; //0x0358
	int32_t N000000B8; //0x035C
	int32_t N00000413; //0x0360
	int32_t N000000B9; //0x0364
	int32_t N00000415; //0x0368
	int32_t SHARP_S; //0x036C
	int32_t CARET; //0x0370
	int32_t ACUTE; //0x0374
	int32_t N00000419; //0x0378
	int32_t N000000BC; //0x037C
	int32_t N0000041B; //0x0380
	int32_t N000000BD; //0x0384
	int32_t N0000041D; //0x0388
	//char pad_038C[1224]; //0x038C
}; //Size: 0x0854